profiling/new-strage-results_stage6_profiling/stage-6_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 215.217ms, rate sampling interval: 1171ms
  Thread calibration: mean lat.: 404.995ms, rate sampling interval: 1737ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.93s     1.38s    4.57s    59.46%
    Req/Sec   482.39     42.03   566.00     58.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.40s 
 75.000%    3.12s 
 90.000%    3.41s 
 99.000%    4.18s 
 99.900%    4.51s 
 99.990%    4.56s 
 99.999%    4.58s 
100.000%    4.58s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.189     0.000000            1         1.00
      23.951     0.100000         4809         1.11
     159.999     0.200000         9619         1.25
     733.695     0.300000        14424         1.43
    1313.791     0.400000        19240         1.67
    2400.255     0.500000        24038         2.00
    2838.527     0.550000        26458         2.22
    2955.263     0.600000        28846         2.50
    3010.559     0.650000        31285         2.86
    3069.951     0.700000        33722         3.33
    3123.199     0.750000        36062         4.00
    3145.727     0.775000        37297         4.44
    3174.399     0.800000        38479         5.00
    3221.503     0.825000        39692         5.71
    3266.559     0.850000        40874         6.67
    3327.999     0.875000        42087         8.00
    3364.863     0.887500        42672         8.89
    3414.015     0.900000        43278        10.00
    3471.359     0.912500        43889        11.43
    3555.327     0.925000        44467        13.33
    3639.295     0.937500        45067        16.00
    3692.543     0.943750        45370        17.78
    3737.599     0.950000        45671        20.00
    3786.751     0.956250        45968        22.86
    3839.999     0.962500        46273        26.67
    3911.679     0.968750        46570        32.00
    3940.351     0.971875        46724        35.56
    3973.119     0.975000        46875        40.00
    4018.175     0.978125        47031        45.71
    4042.751     0.981250        47171        53.33
    4081.663     0.984375        47324        64.00
    4108.287     0.985938        47397        71.11
    4134.911     0.987500        47471        80.00
    4165.631     0.989062        47547        91.43
    4198.399     0.990625        47632       106.67
    4218.879     0.992188        47712       128.00
    4222.975     0.992969        47735       142.22
    4243.455     0.993750        47777       160.00
    4255.743     0.994531        47821       182.86
    4272.127     0.995313        47847       213.33
    4325.375     0.996094        47889       256.00
    4337.663     0.996484        47905       284.44
    4354.047     0.996875        47922       320.00
    4370.431     0.997266        47941       365.71
    4403.199     0.997656        47961       426.67
    4419.583     0.998047        47978       512.00
    4435.967     0.998242        47992       568.89
    4448.255     0.998437        47997       640.00
    4472.831     0.998633        48007       731.43
    4485.119     0.998828        48016       853.33
    4509.695     0.999023        48026      1024.00
    4513.791     0.999121        48029      1137.78
    4526.079     0.999219        48038      1280.00
    4530.175     0.999316        48047      1462.86
    4530.175     0.999414        48047      1706.67
    4546.559     0.999512        48051      2048.00
    4546.559     0.999561        48051      2275.56
    4550.655     0.999609        48058      2560.00
    4550.655     0.999658        48058      2925.71
    4550.655     0.999707        48058      3413.33
    4554.751     0.999756        48062      4096.00
    4554.751     0.999780        48062      4551.11
    4554.751     0.999805        48062      5120.00
    4558.847     0.999829        48064      5851.43
    4558.847     0.999854        48064      6826.67
    4562.943     0.999878        48066      8192.00
    4562.943     0.999890        48066      9102.22
    4567.039     0.999902        48067     10240.00
    4567.039     0.999915        48067     11702.86
    4571.135     0.999927        48069     13653.33
    4571.135     0.999939        48069     16384.00
    4571.135     0.999945        48069     18204.44
    4571.135     0.999951        48069     20480.00
    4571.135     0.999957        48069     23405.71
    4575.231     0.999963        48071     27306.67
    4575.231     1.000000        48071          inf
#[Mean    =     1926.076, StdDeviation   =     1381.777]
#[Max     =     4571.136, Total count    =        48071]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  57372 requests in 1.00m, 3.95MB read
  Non-2xx or 3xx responses: 1335
Requests/sec:    956.16
Transfer/sec:     67.39KB