profiling/new-strage-results_stage6_profiling/stage-6_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 384.760ms, rate sampling interval: 1839ms
  Thread calibration: mean lat.: 598.783ms, rate sampling interval: 2549ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.73s     2.60s   12.61s    70.35%
    Req/Sec   409.67     92.31   548.00     69.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.52s 
 75.000%    9.47s 
 90.000%   10.85s 
 99.000%   12.26s 
 99.900%   12.51s 
 99.990%   12.60s 
 99.999%   12.62s 
100.000%   12.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     866.303     0.000000            1         1.00
    3534.847     0.100000         4087         1.11
    6467.583     0.200000         8208         1.25
    6725.631     0.300000        12287         1.43
    7020.543     0.400000        16403         1.67
    7516.159     0.500000        20436         2.00
    8331.263     0.550000        22482         2.22
    9215.999     0.600000        24747         2.50
    9281.535     0.650000        26690         2.86
    9355.263     0.700000        28701         3.33
    9469.951     0.750000        30652         4.00
    9641.983     0.775000        31708         4.44
    9854.975     0.800000        32732         5.00
   10027.007     0.825000        33711         5.71
   10280.959     0.850000        34739         6.67
   10551.295     0.875000        35785         8.00
   10706.943     0.887500        36278         8.89
   10854.399     0.900000        36780        10.00
   11067.391     0.912500        37294        11.43
   11239.423     0.925000        37802        13.33
   11427.839     0.937500        38323        16.00
   11509.759     0.943750        38579        17.78
   11583.487     0.950000        38827        20.00
   11681.791     0.956250        39093        22.86
   11771.903     0.962500        39359        26.67
   11870.207     0.968750        39597        32.00
   11911.167     0.971875        39725        35.56
   11960.319     0.975000        39848        40.00
   12009.471     0.978125        39983        45.71
   12058.623     0.981250        40116        53.33
   12099.583     0.984375        40235        64.00
   12140.543     0.985938        40291        71.11
   12197.887     0.987500        40355        80.00
   12238.847     0.989062        40430        91.43
   12279.807     0.990625        40483       106.67
   12312.575     0.992188        40550       128.00
   12337.151     0.992969        40581       142.22
   12353.535     0.993750        40606       160.00
   12378.111     0.994531        40646       182.86
   12394.495     0.995313        40673       213.33
   12427.263     0.996094        40716       256.00
   12435.455     0.996484        40725       284.44
   12451.839     0.996875        40747       320.00
   12460.031     0.997266        40753       365.71
   12476.415     0.997656        40775       426.67
   12484.607     0.998047        40783       512.00
   12492.799     0.998242        40797       568.89
   12500.991     0.998437        40809       640.00
   12500.991     0.998633        40809       731.43
   12509.183     0.998828        40820       853.33
   12517.375     0.999023        40825      1024.00
   12525.567     0.999121        40836      1137.78
   12525.567     0.999219        40836      1280.00
   12525.567     0.999316        40836      1462.86
   12533.759     0.999414        40842      1706.67
   12533.759     0.999512        40842      2048.00
   12541.951     0.999561        40845      2275.56
   12550.143     0.999609        40846      2560.00
   12566.527     0.999658        40848      2925.71
   12574.719     0.999707        40852      3413.33
   12574.719     0.999756        40852      4096.00
   12582.911     0.999780        40854      4551.11
   12582.911     0.999805        40854      5120.00
   12599.295     0.999829        40857      5851.43
   12599.295     0.999854        40857      6826.67
   12599.295     0.999878        40857      8192.00
   12599.295     0.999890        40857      9102.22
   12607.487     0.999902        40858     10240.00
   12607.487     0.999915        40858     11702.86
   12615.679     0.999927        40861     13653.33
   12615.679     1.000000        40861          inf
#[Mean    =     7730.869, StdDeviation   =     2599.851]
#[Max     =    12607.488, Total count    =        40861]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49416 requests in 1.00m, 3.16MB read
Requests/sec:    823.56
Transfer/sec:     53.89KB